microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
}

// *****************************************************************************
/* Function:
    InitPWMGenerators()

  Summary:
    Routine to initialise PWM Module for Inverters

  Description:
    Function initialises  and enable the PWM Module after configuration

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitPWMGenerators(void)
{
    // PTCON: PWMx TIME BASE CONTROL REGISTER
    // PTEN(15): PWMx Module Enable bit
    // Unimplemented(14): Read as ?0?
    // PTSIDL(13): PWMx Time Base Stop in Idle Mode bit
    // SESTAT(12): Special Event Interrupt Status bit
    // SEIEN(11): Special Event Interrupt Enable bit
    // EIPU(1): Enable Immediate Period Updates bit(1)
    // SYNCPOL(9): Synchronize Input and Output Polarity bit(1)
    // SYNCOEN(8): Primary Time Base Sync Enable bit(1)
    // SYNCEN(7): External Time Base Synchronization Enable bit
    // SYNCSRC<(6-4): Synchronous Source Selection bits(1)
    // SEVTPS(3-0): PWMx Special Event Trigger Output Postscaler Select bits
    PTCON = 0;               // 0b0000 0000 0000 0000(PWM Module is disabled)
    PTCONbits.EIPU = 0;      // 0 = Active Period register updates occur
                             // on PWMx cycle boundaries

    // PTCON2: PWMx PRIMARY MASTER CLOCK DIVIDER SELECT REGISTER
    // Unimplemented(15-3): Read as ?0?
    // PCLKDIV(2-0): PWMx Input Clock Prescaler (Divider) Select bits
    PTCON2 = 0;              // 0b0000 0000 0000 0000(PWM Module is disabled)
    PTCON2bits.PCLKDIV = 0;  // 0b000 = Divide-by-1, max PWM timing resolution
    
    PTPER = 2*LOOPTIME_TCY + 1;
    SEVTCMP = 0;
    
    InitPWM123Generators();

    __delay_us(2);
  
    PTCONbits.PTEN = 1;      // Enable PWM module after initialising generators

}

// *****************************************************************************
/* Function:
    InitPWM123Generators()

  Summary:
    Routine to initialise PWM generators 1,2,3 

  Description:
    Function initialises PWM module for 3-phase inverter control in Complimentary
    mode ;initialises period,dead time;Configures PWM fault control logic

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitPWM123Generators(void)
{
    // PWMCONx: PWMx CONTROL REGISTER
    // FLTSTAT(15): Fault Interrupt Status bit
    // CLSTAT(14): Current-Limit Interrupt Status bit
    // TRGSTAT(13): Trigger Interrupt Status bit
    // FLTIEN(12): Fault Interrupt Enable bit
    // CLIEN(11): Current-Limit Interrupt Enable bit
    // TRGIEN(10): Trigger Interrupt Enable bit
    // ITB(9): Independent Time Base Mode bit
    // MDCS(8): Master Duty Cycle Register Select bit
    // DTC(7-6): Dead-Time Control bits
    // DTCP(5): Dead-Time Compensation Polarity bit
    // Unimplemented(4-3): Read as ?0?
    // CAM(2): Centrer-Aligned Mode Enable bit
    // XPRES(1): External PWMx Reset Control bit
    // IUE(0): Immediate Update Enable bit
    PWMCON1 = 0;                // 0b0000 0000 0000 0000
    PWMCON2 = 0;                // 0b0000 0000 0000 0000
    PWMCON3 = 0;                // 0b0000 0000 0000 0000

    PWMCON1bits.FLTIEN = 0;     // 0 = Fault interrupt is disabled
    PWMCON2bits.FLTIEN = 0;     // 0 = Fault interrupt is disabled
    PWMCON3bits.FLTIEN = 0;     // 0 = Fault interrupt is disabled

    PWMCON1bits.CLIEN = 0;      // 0 = Current-limit interrupt is disabled
    PWMCON2bits.CLIEN = 0;      // 0 = Current-limit interrupt is disabled
    PWMCON3bits.CLIEN = 0;      // 0 = Current-limit interrupt is disabled

    PWMCON1bits.TRGIEN = 1;     // 1 = Trigger event interrupts are enabled
    PWMCON2bits.TRGIEN = 0;     // 0 = Trigger event interrupts are disabled
    PWMCON3bits.TRGIEN = 0;     // 0 = Trigger event interrupts are disabled

    PWMCON1bits.ITB = 1;        // 1 = PHASE1 register provides time base period
    PWMCON2bits.ITB = 1;        // 1 = PHASE2 register provides time base period
    PWMCON3bits.ITB = 1;        // 1 = PHASE3 register provides time base period

    PWMCON1bits.MDCS = 0;       // 0 = PDC1 register provides duty cycle
    PWMCON2bits.MDCS = 0;       // 0 = PDC2 register provides duty cycle
    PWMCON3bits.MDCS = 0;       // 0 = PDC3 register provides duty cycle

    PWMCON1bits.DTC = 0;        // 00 = Positive dead time is actively applied
    PWMCON2bits.DTC = 0;        // 00 = Positive dead time is actively applied
    PWMCON3bits.DTC = 0;        // 00 = Positive dead time is actively applied

    PWMCON1bits.CAM = 1;        // 1 = Centre-Aligned mode is enabled
    PWMCON2bits.CAM = 1;        // 1 = Centre-Aligned mode is enabled
    PWMCON3bits.CAM = 1;        // 1 = Centre-Aligned mode is enabled

    PWMCON1bits.IUE = 0;        // 0 = Updates to the active
                                // MDC/PDC1/DTR1/ALTDTR1/PHASE1 registers are
                                // synchronized to the PWM1 period boundary
    PWMCON1bits.IUE = 0;        // 0 = Updates to the active
                                // MDC/PDC2/DTR2/ALTDTR2/PHASE2 registers are
                                // synchronized to the PWM2 period boundary
    PWMCON1bits.IUE = 0;        // 0 = Updates to the active
                                // MDC/PDC3/DTR3/ALTDTR3/PHASE3 registers are
                                // synchronized to the PWM3 period boundary

    // PHASEx: PWMx PRIMARY PHASE-SHIFT REGISTER
    // PHASEx register provides time base period, if PWMCONxbits.ITB = 1
    PHASE1 = LOOPTIME_TCY;      // Setting PWM period for PWM1 generator
    PHASE2 = LOOPTIME_TCY;      // Setting PWM period for PWM2 generator
    PHASE3 = LOOPTIME_TCY;      // Setting PWM period for PWM3 generator
    
    // DTRx: PWMx DEAD-TIME REGISTER
    DTR1 = 0x0000;              // Not used in centre aligned mode
    DTR2 = 0x0000;              // Not used in centre aligned mode
    DTR3 = 0x0000;              // Not used in centre aligned mode

    // ALTDTRx: PWMx ALTERNATE DEAD-TIME REGISTER
    // Provides 14-Bit Dead-Time Value for PWMx generator if PWMCONxbits.CAM = 1
    ALTDTR1 = DDEADTIME;        // Setting dead-time for PWM1 generator
    ALTDTR2 = DDEADTIME;        // Setting dead-time for PWM2 generator
    ALTDTR3 = DDEADTIME;        // Setting dead-time for PWM3 generator

    // PDCx: PWMx GENERATOR DUTY CYCLE REGISTER
    // Initialise the PWM duty cycle register
    PDC1 = MIN_DUTY;
    PDC2 = MIN_DUTY;
    PDC3 = MIN_DUTY;

    // IOCONx: PWMx I/O CONTROL REGISTER
    // PENH(15): PWMxH Output Pin Ownership bit
    // PENL(14): PWMxL Output Pin Ownership bit
    // POLH(13): PWMxH Output Pin Polarity bit
    // POLL(12): PWMxL Output Pin Polarity bit
    // PMOD(11:10): PWMx I/O Pin Mode bits
    // OVRENH(9): Override Enable for PWMxH Pin bit
    // OVRENL(8): Override Enable for PWMxL Pin bit
    // OVRDAT(7:6): Data for PWMxH, PWMxL Pins if Override is Enabled bits
    // FLTDAT(5:4): Data for PWMxH and PWMxL Pins if FLTMOD is Enabled bits.
    // CLDAT(1:0): Data for PWMxH and PWMxL Pins if CLMOD is Enabled bits
    // SWAP(1): SWAP PWMxH and PWMxL Pins bit
    // OSYNC(1): Output Override Synchronization bit
    IOCON1 = 0x0000;        // 0b0000 0000 0000 0000(GPIO controls PWM1H,L pins)
    IOCON2 = 0x0000;        // 0b0000 0000 0000 0000(GPIO controls PWM2H,L pins)
    IOCON3 = 0x0000;        // 0b0000 0000 0000 0000(GPIO controls PWM3H,L pins)
    
    IOCON1bits.PENH = 1;    // 1 = PWM1H pin is active-high
    IOCON2bits.PENH = 1;    // 1 = PWM2H pin is active-high
    IOCON3bits.PENH = 1;    // 1 = PWM3H pin is active-high
    
