microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
    IOCON1bits.PENL = 1;    // 1 = PWM1L pin is active-high
    IOCON2bits.PENL = 1;    // 1 = PWM2L pin is active-high
    IOCON3bits.PENL = 1;    // 1 = PWM3L pin is active-high
    
    IOCON1bits.POLH = 0;    // 0 = PWM1H pin is active-high
    IOCON2bits.POLH = 0;    // 0 = PWM2H pin is active-high
    IOCON3bits.POLH = 0;    // 0 = PWM3H pin is active-high
    
    IOCON1bits.POLL = 0;    // 0 = PWM1L pin is active-high
    IOCON2bits.POLL = 0;    // 0 = PWM2L pin is active-high
    IOCON3bits.POLL = 0;    // 0 = PWM3L pin is active-high
   
    IOCON1bits.FLTDAT = 0;  // 0b00 = If Fault is active, PWM1H,L is driven LOW
    IOCON2bits.FLTDAT = 0;  // 0b00 = If Fault is active, PWM2H,L is driven LOW
    IOCON3bits.FLTDAT = 0;  // 0b00 = If Fault is active, PWM3H,L is driven LOW
    
    IOCON1bits.PMOD = 0;    // 0b00 = PWM1 pair is in the Complementary O/P mode
    IOCON1bits.PMOD = 0;    // 0b00 = PWM2 pair is in the Complementary O/P mode
    IOCON1bits.PMOD = 0;    // 0b00 = PWM3 pair is in the Complementary O/P mode

    // TRGCONx: PWMx TRIGGER CONTROL REGISTER
    // TRGDIV (15-12): Trigger Output Divider bits
    // Unimplemented(11-6): Read as ?0?
    // TRGSTRT(5:0): Trigger Postscaler Start Enable Select bits
    TRGCON1 = 0x0000;       // 0b0000 UUUU UU00 0000
    TRGCON2 = 0x0000;       // 0b0000 = Trigger output for every trigger event
    TRGCON3 = 0x0000;       // 0b0000 = Trigger output for every trigger event

    TRGCON1bits.TRGDIV = 0; // 0b0000 = Trigger output for every trigger event
    TRGCON2bits.TRGDIV = 0; // 0b0000 = Trigger output for every trigger event
    TRGCON3bits.TRGDIV = 0; // 0b0000 = Trigger output for every trigger event

    TRGCON1bits.TRGSTRT = 0;// 000000 = Waits 0 PWM cycles before generating
                            // the 1st trigger event after the module is enabled
    TRGCON2bits.TRGSTRT = 0;// 000000 = Waits 0 PWM cycles before generating
                            // the 1st trigger event after the module is enabled
    TRGCON3bits.TRGSTRT = 0;// 000000 = Waits 0 PWM cycles before generating
                            // the 1st trigger event after the module is enabled

    // TRIGx: PWMx PRIMARY TRIGGER COMPARE VALUE REGISTER
    // TRGCMP(15:0): Trigger Control Value bits
    // When the primary PWMx functions in local time base, 
    // this register contains the compare values that can trigger the ADC module.
    TRIG1 = 0;         // Set to trigger ADC at the PWM edge
    TRIG2 = 0;                  // Set at centre of the PWM (not used)
    TRIG3 = 0;                  // Set at centre of the PWM (not used)
    
    // FCLCONx: PWMx FAULT CURRENT-LIMIT CONTROL REGISTER
    // Unimplemented(15): Read as '0'
    // CLSRC(14:10): Current-Limit Control Signal Source Select 
    // CLPOL(9): Current-Limit Polarity for PWM Generator bit
    // CLMOD (8): Current-Limit Mode Enable for PWM Generator bit
    // FLTSRC(7:3): Fault Control Signal Source Select for PWM Generator bits
    // FLTPOL (2): Fault Polarity for PWM Generator bit
    // FLTMOD (1:0): Fault Mode for PWM Generator bits 
    FCLCON1 = 0x0003;           // 0bU000 0000 0000 0011(Fault input is disabled) 
    FCLCON2 = 0x0003;           // 0bU000 0000 0000 0011(Fault input is disabled)
    FCLCON3 = 0x0003;           // 0bU000 0000 0000 0011(Fault input is disabled)
    
    FCLCON1bits.FLTSRC = 0x9;  // 0b01000 = Fault SRC is CMP2
    FCLCON2bits.FLTSRC = 0x9;  // 0b01000 = Fault SRC is CMP2
    FCLCON3bits.FLTSRC = 0x9;  // 0b01000 = Fault SRC is CMP2
    
    FCLCON1bits.FLTPOL = 1;     // 1 = The selected Fault source is active-low
    FCLCON2bits.FLTPOL = 1;     // 1 = The selected Fault source is active-low
    FCLCON3bits.FLTPOL = 1;     // 1 = The selected Fault source is active-low
    
    FCLCON1bits.FLTMOD = 0;     // 0b01 = forces PWM1H,L to FLTDAT values(cycle)
    FCLCON2bits.FLTMOD = 0;     // 0b01 = forces PWM2H,L to FLTDAT values(cycle)
    FCLCON3bits.FLTMOD = 0;     // 0b01 = forces PWM3H,L to FLTDAT values(cycle)

    // Configuring PWMx Generators Interrupts and Priority
    IPC23bits.PWM1IP = 6;       // PWM1 Interrupt Priority is 6
    IPC23bits.PWM2IP = 4;       // PWM2 Interrupt Priority is 4
    IPC24bits.PWM3IP = 4;       // PWM3 Interrupt Priority is 4

    IFS5bits.PWM1IF = 0;        // Clear PWM1 Interrupt flag
    IFS5bits.PWM2IF = 0;        // Clear PWM1 Interrupt flag
    IFS6bits.PWM3IF = 0;        // Clear PWM1 Interrupt flag

    IEC5bits.PWM1IE = 1;        // Enable PWM1 Interrupt
    IEC5bits.PWM2IE = 0;        // Disable PWM2 Interrupt
    IEC6bits.PWM3IE = 0;        // Disable PWM3 Interrupt

}
// *****************************************************************************
/* Function:
    ChargeBootstarpCapacitors()

  Summary:
    Routine to initialise PWM generators 1,2,3 to charge bootstrap capacitors

  Description:
    Function to charge bootstrap capacitors initially

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void ChargeBootstrapCapacitors(void)
{
    /*To ensure minimum pulse before turning ON the override*/
    pwmDutycycle.dutycycle1 = LOOPTIME_TCY - MIN_DUTY;
    pwmDutycycle.dutycycle2 = LOOPTIME_TCY - MIN_DUTY;
    pwmDutycycle.dutycycle3 = LOOPTIME_TCY - MIN_DUTY;
    
    __delay_us(100);

    // Enable PWMs only on PWMxL ,to charge bootstrap capacitors initially
    // Hence PWMxH is over-ridden to "LOW"
    IOCON1bits.OVRDAT = 0;  // 0b00 = State for PWM1H,L, if Override is Enabled
    IOCON2bits.OVRDAT = 0;  // 0b00 = State for PWM1H,L, if Override is Enabled
    IOCON3bits.OVRDAT = 0;  // 0b00 = State for PWM1H,L, if Override is Enabled

    IOCON1bits.OVRENH = 1;  // 1 = OVRDAT<1> provides data for output on PWM1H
    IOCON2bits.OVRENH = 1;  // 1 = OVRDAT<1> provides data for output on PWM1H
    IOCON3bits.OVRENH = 1;  // 1 = OVRDAT<1> provides data for output on PWM1H

    IOCON1bits.OVRENL = 0;  // 0 = PWM generator provides data for PWM1L pin
    IOCON2bits.OVRENL = 0;  // 0 = PWM generator provides data for PWM2L pin
    IOCON3bits.OVRENL = 0;  // 0 = PWM generator provides data for PWM3L pin

    // PDCx: PWMx GENERATOR DUTY CYCLE REGISTER
    // Initialise the PWM duty cycle for charging
    pwmDutycycle.dutycycle1 = LOOPTIME_TCY - (TICKLE_CHARGE_COUNTS);
    pwmDutycycle.dutycycle2 = LOOPTIME_TCY - (TICKLE_CHARGE_COUNTS);
    pwmDutycycle.dutycycle3 = LOOPTIME_TCY - (TICKLE_CHARGE_COUNTS);

    /*Tickle charge duration*/
    __delay_us(BOOTSTRAP_CHARGING_TIME);
    
