microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
    /*Reseting the PWM duties to Minimum*/
    pwmDutycycle.dutycycle1 = MIN_DUTY;
    pwmDutycycle.dutycycle2 = MIN_DUTY;
    pwmDutycycle.dutycycle3 = MIN_DUTY;

    __delay_us(500);
         
    /*Disabling the PWM Outputs using Override feature*/
    IOCON1 = 0xC301;
    IOCON2 = 0xC301;
    IOCON3 = 0xC301;    
    __delay_us(100);
}
// *****************************************************************************
/* Function:
    Init_ADC1

  Summary:
    Routine to initialise ADC 

  Description:
    Function initialises the ADC1 for simultaneously sampling four AD channels
    Measures offset on all channels .

  Precondition:
    None.

  Parameters:
    Pointer to ADC_OFFSET_T structure variable created to store ADC1 offset is
    passed to this function

  Returns:
    Structure will contain the averaged initial offset value of all 4 channels

  Remarks:
    None.
 */
void InitADCModule1(ADC_OFFSET_T *adc_offset)
{
    volatile uint16_t i = 0;

    // AD1CON1: ADC1 CONTROL REGISTER 1
    // ADON(15): ADC Operating Mode bit
    // Unimplemented(14,11): Read as '0'
    // ADSIDL(13): ADC Stop in Idle Mode bit
    // ADDMABM(12): DMA Buffer Build Mode bit
    // AD12B(10): 10-Bit or 12-Bit ADC Operation Mode bit
    // FORM(9-8): Data Output Format bits
    // SSRC(7-5>: Sample Clock Source Select bits
    // SSRCG(4): Sample Trigger Source Group bit
    // SIMSAM(3): Simultaneous Sample Select bit (only if CHPS<1:0> = 01 or 1x)
    // In 12-Bit Mode (AD12B = 1), SIMSAM is Unimplemented and is Read as '0'
    // ASAM(2): ADC Sample Auto-Start bit
    // SAMP(1): ADC Sample Enable bit
    // DONE(0): ADC Conversion Status bit
    AD1CON1 = 0;            // 0b0U00 U000 0000 0000 (0 = ADC is OFF)
    AD1CON1bits.AD12B = 0;   // 0 = 10-bit, 4-channel ADC operation possible
    AD1CON1bits.FORM = 3;   // 11 = Signed fractional(DOUT = sddd dddd dd00 0000
                            // Range is shown below for 10bit operation:
                            // 0b0111 1111 1100 0000 = 0.99804
                            // 0b0000 0000 0000 0000 = 0
                            // 0b1000 0000 0000 0000 = -1

    AD1CON1bits.SSRCG = 0;  // if SSRCG =  0,
    AD1CON1bits.SSRC = 3;   // 011=PWM primary Special Event Trigger 
                            //ends sampling and starts conversion
   
    
    AD1CON1bits.SIMSAM = 1; // Samples CH0-CH3 simultaneously(if CHPS = 1x).
    AD1CON1bits.ASAM = 1;   // Sampling begins immediately after
                            // last conversion completes.SAMP bit is auto set.
    AD1CON1bits.DONE = 0;   // ADC conversion has not started

    // ADxCON2: ADCx CONTROL REGISTER 2
    // VCFG(15-13): Converter Voltage Reference Configuration bits
    // Unimplemented(12-11): Read as ?0?
    // CSCNA(10): Input Scan Select bit
    // CHPS(9-8): Channel Select bits
    // In 12-Bit Mode,CHPS<1:0> Bits are Unimplemented and are Read as ?0?
    // BUFS(7): Buffer Fill Status bit (only valid when BUFM = 1)
    // SMPI(6-2): Increment Rate bits
    // BUFM(1): Buffer Fill Mode Select bit
    // ALTS(0): Alternate Input Sample Mode Select bit
    AD1CON2 = 0;
    AD1CON2bits.VCFG = 0;   // ADC Voltage Reference VREFH = AVDD; VREFL = AVSS
    AD1CON2bits.CSCNA = 0;  // 0 = Does not scan inputs
#ifdef  SINGLE_SHUNT
    AD1CON2bits.CHPS = 0;   // 0 = Converts CH0
#else
    AD1CON2bits.CHPS = 2;   // 1x = Converts CH0, CH1, CH2 and CH3
#endif
    AD1CON2bits.SMPI = 0;   // x0000 = Generates interrupt after completion
                            // of every sample/conversion operation
    AD1CON2bits.BUFM = 0;   // 0 = Starts filling buffer from the Start address
    AD1CON2bits.ALTS = 0;   // 0 = Uses channel I/P selects for Sample MUXA

    // ADxCON3: ADCx CONTROL REGISTER 3
    // ADRC(15): ADC Conversion Clock Source bit
    // Unimplemented(14-13): Read as ?0?
    // SAMC(12-8): Auto-Sample Time bits
    // ADCS(7-0): ADC Conversion Clock Select bits
    AD1CON3 = 0;
    AD1CON3bits.ADRC = 0;       // 0 = Clock derived from system clock
    // ADC Conversion Clock Select bits
    // Tp*(ADCS<7:0> + 1) = Tp*(6+1) = 7 Tp = 1 Tad
    // 7 * (1/ Fp) = 7 * (1 / Fcy) = 100nSec
    AD1CON3bits.ADCS = ADC_MIN_ADCS_COUNTS;

    // ADxCON4: ADCx CONTROL REGISTER 4
    // Unimplemented(15-9,7-3): Read as ?0?
    // ADDMAEN(8): ADC DMA Enable bit
    // DMABL(2-0): Selects Number of DMA Buffer Locations per Analog Input bits
    AD1CON4 = 0;                   // Not used in the application

    // ADxCHS123: ADCx INPUT CHANNEL 1, 2, 3 SELECT REGISTER
    // Unimplemented(15-11,7-3): Read as '0'
    // CH123SB(8): Channels 1, 2, 3 Positive Input Select for Sample B bits
    // CH123NB(10:9): Channels 1, 2, 3 Negative Input Select for Sample B bits
    // CH123SA(0): Channels 1, 2, 3 Positive Input Select for Sample A bits
    // CH123NA(2-1): Channels 1, 2, 3 Negative Input Select for Sample A bits
    AD1CHS123 = 0x0000;            // 0bUUUU U000 UUUU U000
    AD1CHS123bits.CH123SB = 0;     // Not used int the application
    AD1CHS123bits.CH123NB = 0;     // 0x = CH1, CH2, CH3 negative input is VREFL

    // Sets the simultaneously sampled channels
    // Refer periph.h for details
    AD1CHS123bits.CH123SA = ADC1_ANx_CH123;
    AD1CHS123bits.CH123NA = 0;     // 0x = CH1, CH2, CH3 negative input is VREFL
    
    // AD1CHS0: ADC1 INPUT CHANNEL 0 SELECT REGISTER
    // CH0NB(15): Channel 0 Negative Input Select for Sample MUXB bit
    // CH0SB(13-8): Channel 0 Positive Input Select for Sample MUXB bits(1,4,5)
    // CH0NA(7): Channel 0 Negative Input Select for Sample MUXA bit
    // CH0SA(5:0): Channel 0 Positive Input Select for Sample MUXA bits(1,4,5)
    // Unimplemented(14,6): Read as '0'
    AD1CHS0 = 0;
    AD1CHS0bits.CH0NB = 0;  // 0 = Channel 0 negative input is VREFL
    AD1CHS0bits.CH0SB = 0;  // 0b000000 (Not used in this application)
    AD1CHS0bits.CH0NA = 0;  // 0 = Channel 0 negative input is VREFL
	// CH0 is used for measuring dc bus current
    AD1CHS0bits.CH0SA = ADC1_ANx_CH0_IBUS;
    
    // AD1CSSH: ADC1 INPUT SCAN SELECT REGISTER HIGH
    // CSS(31-16): ADC Input Scan Selection bits
    AD1CSSH = 0;

    // AD1CSSL: ADC1 INPUT SCAN SELECT REGISTER LOW
    // CSS(15-0): ADC Input Scan Selection bits
    AD1CSSL = 0;

