microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/sip-mc-development-board-an1299-dspic33edv64mc205/hal/periph.c
    // Configuring ADCx Generators Interrupts and Priority
    IPC3bits.AD1IP = 7;         // 0b111 ADC1 Interrupt Priority is 7
    IFS0bits.AD1IF = 0;         // 0 = Clear ADC1 Interrupt flag
    IEC0bits.AD1IE = 0;         // 0 = Disable ADC1 Interrupt

    AD1CON1bits.ADON = 1;

    // Time to Stabilize Analog Stage from ADC Off to ADC On
    __delay_us(ADC_TON_DELAY_MICROSEC);
    
    // Taking multiple sample to measure voltage offset in all the channels
    for (i = 0; i < 128; i++)
    {
        // Wait for the conversion to complete
        while (!AD1CON1bits.DONE);
        // Sum up the converted results
        iADCOffsetCH0 += ADC1BUF0;
        iADCOffsetCH1 += ADC1BUF1;
        iADCOffsetCH2 += ADC1BUF2;
        iADCOffsetCH3 += ADC1BUF3;
    }
    /* Averaging CHO result to find voltage offset*/
    adc_offset->ch0 = (int16_t)(iADCOffsetCH0 >> 7);
    /* Averaging CH1 result to find voltage offset*/
    adc_offset->ch1 = (int16_t)(iADCOffsetCH1 >> 7);
    /* Averaging CH2 result to find voltage offset*/
    adc_offset->ch2 = (int16_t)(iADCOffsetCH2 >> 7);
    /* Averaging CH3 result to find voltage offset*/
    adc_offset->ch3 = (int16_t)(iADCOffsetCH3 >> 7);
    
}
// *****************************************************************************
/* Function:
    Init_Peripherals()

  Summary:
    Routine initializes controller peripherals

  Description:
    Routine to initialize Peripherals used for Inverter Control

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitPeripherals(void)
{
    /* Initialize comparator and amplifiers */
    InitAmplifiersComparator();
    /* Initialize PWM generators */
    InitPWMGenerators();
    /* Initialize the ADC used for sensing Inverter A parameters */
    InitADCModule1(&adcOffset);
    
    __delay_us(50);
}
